app/Http/Controllers/Auth/RegisteredUserController.php

insert into `users` (`name`, `email`, `password`, `updated_at`, `created_at`) values ('Asif', 'asif@gmail.com', '$2y$12$cm3tjJWwsHqDhcQv2pqweueOMpaWr901yM1cVS9lXYk0sXLaURn8q', '2025-03-24 10:11:30', '2025-03-24 10:11:30')
---
    public function store(Request $request): RedirectResponse
    {
        $request->validate([
            'name' => ['required', 'string', 'max:255'],
            'email' => ['required', 'string', 'lowercase', 'email', 'max:255', 'unique:'.User::class],
            'password' => ['required', 'confirmed', Rules\Password::defaults()],
        ]);

        $user = User::create([
            'name' => $request->name,
            'email' => $request->email,
            'password' => Hash::make($request->password),
        ]);