app/Http/Controllers/DashboardController.php

    public function index()
    {
        $rooms = Room::orderby('code')->get();
---
select * from `rooms` order by `code` asc