app/Http/Controllers/EstimationController.php

    public function index(Request $request)
    {
        $estimations = DB::table('estimations')->get();
---
select * from `estimations`

    public function store(Request $request)
    {
        $validatedData = $request->validate([
            'productsData' => 'required|string',
            'totalPrice' => 'required|numeric',
            'image' => 'nullable|image|mimes:png,jpg,jpeg|max:2048',
        ]);

        $imagePath = null;
        if ($request->hasFile('image')) {
            $image = $request->file('image');
            $imageName = time() . '_' . $image->getClientOriginalName();
            $image->move(public_path('uploads/estimations'), $imageName);
            $imagePath = 'uploads/estimations/' . $imageName;
        }

        $user = Auth::user();
        $role = DB::table('roles')
            ->join('model_has_roles', 'roles.id', '=', 'model_has_roles.role_id')
            ->where('model_has_roles.model_id', $user->id)
            ->select('roles.id')
            ->first();

        $estimationId = DB::table('estimations')->insertGetId([
            'user_id' => $role->id,
            'image' => $imagePath,
            'total' => $validatedData['totalPrice'],
            'created_at' => now(),
            'updated_at' => now(),
        ]);
---
select `roles`.`id` from `roles` inner join `model_has_roles` on `roles`.`id` = `model_has_roles`.`role_id` where `model_has_roles`.`model_id` = 2 limit 1
insert into `estimations` (`user_id`, `image`, `total`, `created_at`, `updated_at`) values (2, 'uploads/estimations/1744025144_canvas-image.png', '110', '2025-04-07 11:25:44', '2025-04-07 11:25:44')

            ];
        }

       $saved =  DB::table('estimation_products')->insert($productData);
---
insert into `estimation_products` (`created_at`, `estimation_id`, `name`, `price`, `product_id`, `updated_at`, `x_position`, `y_position`) values ('2025-04-07 11:25:44', 7, 'ف', '110.00', '1', '2025-04-07 11:25:44', 111.59999084473, 13.800003051758)

    public function sensors()
    {
        $user = Auth::user();

        if (!$user) {
            return response()->json(['error' => 'Unauthorized'], 401);
        }

        $role = DB::table('roles')
            ->join('model_has_roles', 'roles.id', '=', 'model_has_roles.role_id')
            ->where('model_has_roles.model_id', $user->id)
            ->select('roles.id')
            ->first();

        if (!$role) {
            return response()->json(['error' => 'User has no assigned role'], 403);
        }

        $products = DB::table('products')
            ->join('product_role', 'products.id', '=', 'product_role.product_id')
            ->where('product_role.role_id', $role->id)
            ->select('products.*', 'product_role.price')
            ->orderBy('products.id', 'asc')
            ->get();
---
select `roles`.`id` from `roles` inner join `model_has_roles` on `roles`.`id` = `model_has_roles`.`role_id` where `model_has_roles`.`model_id` = 2 limit 1
select `products`.*, `product_role`.`price` from `products` inner join `product_role` on `products`.`id` = `product_role`.`product_id` where `product_role`.`role_id` = 2 order by `products`.`id` asc