app/Http/Controllers/ProductController.php

select * from `products` order by `code` asc, `created_at` desc limit 25 offset 0
select count(*) as aggregate from `products`
---
    public function index(): View
    {
        return view('products.index', [
            'products' => Product::orderby('code')->latest()->paginate(25)
        ]);

select * from `products` where exists (select * from `rooms` inner join `product_room` on `rooms`.`id` = `product_room`.`room_id` where `products`.`id` = `product_room`.`product_id` and `room_id` = 21) order by `code` asc
select * from `quotations` where `user_id` = 12 and `status` = 'pending' limit 1
---
    public function filterByRoom(Room $room)
    {
        // Retrieve all products that belong to this category

        $products = Product::whereHas('rooms', function ($query) use ($room) {
            $query->where('room_id', $room->id);
        })
        ->orderby('code')
        ->get();

        $quotation = Quotation::where('user_id', Auth::id())
            ->where('status', 'pending')->first();

select * from `rooms`
select * from `roles`
---
    public function create(): View
    {

        $rooms = Room::all(); // Fetch all rooms for the Select2 dropdown
        $roles = Role::all(); // Fetch all roles for the price input