app/Http/Controllers/QuotationController.php

    public function addToQuotation(Request $request, Product $product, $productroom)
    {
        // Get the current user
        $user = Auth::user();

        // Check if the user already has an active quotation
        $quotation = Quotation::firstOrCreate(
            ['user_id' => $user->id, 'status' => 'pending'],
            ['status' => 'pending']
        );

        //$productroom = ProductRoom::find($productroom);

        $productprice= $product->priceByRole($user);

        if ($quotation->products()
            ->wherePivot('product_id', $product->id)
            ->wherePivot('product_room_id', $productroom)
            ->exists()
        ) {
---
select * from `quotations` where (`user_id` = 12 and `status` = 'pending') limit 1
select exists(select * from `products` inner join `product_quotation` on `products`.`id` = `product_quotation`.`product_id` where `product_quotation`.`quotation_id` = 6 and `product_quotation`.`product_id` = 29 and `product_quotation`.`product_room_id` = '3') as `exists`

    public function index()
    {
        // Get the current user
        $user = Auth::user();

        // Retrieve all quotations for the user
        if($user->hasRole('Admin')){
            $quotations = Quotation::with('products')->get();
        }else{
            $quotations = Quotation::where('user_id', $user->id)->with('products')->get();
---
select * from `quotations`
select `products`.*, `product_quotation`.`quotation_id` as `pivot_quotation_id`, `product_quotation`.`product_id` as `pivot_product_id`, `product_quotation`.`quantity` as `pivot_quantity`, `product_quotation`.`price` as `pivot_price`, `product_quotation`.`product_room_id` as `pivot_product_room_id`, `product_quotation`.`note` as `pivot_note`, `product_quotation`.`created_at` as `pivot_created_at`, `product_quotation`.`updated_at` as `pivot_updated_at` from `products` inner join `product_quotation` on `products`.`id` = `product_quotation`.`product_id` where `product_quotation`.`quotation_id` in (1, 2)
select * from `quotations` where `user_id` = 1
select `products`.*, `product_quotation`.`quotation_id` as `pivot_quotation_id`, `product_quotation`.`product_id` as `pivot_product_id`, `product_quotation`.`quantity` as `pivot_quantity`, `product_quotation`.`price` as `pivot_price`, `product_quotation`.`product_room_id` as `pivot_product_room_id`, `product_quotation`.`note` as `pivot_note`, `product_quotation`.`created_at` as `pivot_created_at`, `product_quotation`.`updated_at` as `pivot_updated_at` from `products` inner join `product_quotation` on `products`.`id` = `product_quotation`.`product_id` where `product_quotation`.`quotation_id` in (1)

    public function removePdf(Quotation $quotation)
    {
        // Ensure the user owns the quotation
        if ($quotation->user_id !== Auth::id()) {
            return redirect()->back()->with('error', 'Unauthorized');
        }

        // Delete the PDF file from storage
        if ($quotation->pdf_path) {
            Storage::disk('public')->delete($quotation->pdf_path);
            $quotation->pdf_path = null;
            $quotation->save();
---
update `quotations` set `pdf_path` = null, `quotations`.`updated_at` = '2025-03-20 08:18:41' where `id` = 1

    public function store(Request $request)
    {
        // Validate the request data
        $request->validate([
            'title' => 'required|string|max:255',
        ]);
        // Create a new quotation
        $quotation = new Quotation();
        $quotation->title = $request->title;
        $quotation->status = "pending";
        $quotation->user_id = Auth::id();
        $quotation->save();
---
insert into `quotations` (`title`, `status`, `user_id`, `updated_at`, `created_at`) values ('Test Title', 'pending', 1, '2025-03-20 08:08:52', '2025-03-20 08:08:52')