app/Http/Controllers/UserController.php

    public function index(Request $request): View
    {
        $users = User::latest()->paginate(15);
---
select * from `users` order by `created_at` desc limit 15 offset 0
select count(*) as aggregate from `users`