app/Models/Product.php

    public function priceByRole($user)
    {
        $role = $user->roles()->first();
        // dd($role);
        return $this->roles()->where('role_id', $role->id)->first()?->pivot->price;
---
select `roles`.*, `product_role`.`product_id` as `pivot_product_id`, `product_role`.`role_id` as `pivot_role_id`, `product_role`.`price` as `pivot_price` from `roles` inner join `product_role` on `roles`.`id` = `product_role`.`role_id` where `product_role`.`product_id` = 29 and `role_id` = 4 limit 1